<!DOCTYPE HTML>
<html>
<head>
	<meta charset='UTF-8' />
	<meta http-equiv='Content-Type' content="text/html; charset=UTF-8" />
	<meta name='description' content="S.O.S. Hacklab Independência - colabore para manter serviços livres e independentes no ar" />
	<meta name='keywords' content="solidariedade, hacklab, independência, hi.ato.br, Porto Alegre, S.O.S., pirata" />
	<meta name='author' content='./humans.txt' />
	<link rel='stylesheet' type='text/css' href='./estilos.css' />
	<title>Colabore com o Hacklab Independência</title>
</head>
<body>
<div id="fb-root"></div>
<script>
(
function(d, s, id) {
	var js, fjs = d.getElementsByTagName(s)[0];
	if (d.getElementById(id)) return;
	js = d.createElement(s); js.id = id;
	js.src = "//connect.facebook.net/pt_BR/sdk.js#xfbml=1&appId=736182579788194&version=v2.0";
	fjs.parentNode.insertBefore(js, fjs);
	}
	(document, 'script', 'facebook-jssdk')
);
</script>
<a name='top' />
<div class='conteudo'>
<h1>Solidariedade pirata de classe</h1>
<p>Manter os serviços listados abaixo custa caro e eu n&atilde;o tenho mais como pagar sozinho.</p>
<p>Foi bom trabalhar sozinho e aprendi bastante, mas terminou meu tempo e meu dinheiro. Ou algu&eacute;m pega junto ou ent&atilde;o vamos assumir que n&atilde;o queremos independ&ecirc;ncia e vamos todas(os) pro Facebook.</p>
<hr>
<a name='faq' />
<h2>O que &eacute; isto?</h2>
<p>Hacklab Independ&ecirc;ncia &eacute; uma iniciativa entre v&aacute;rias que tentam tornar a internet livre e independente como j&aacute; foi e n&atilde;o &eacute; mais.</p>
<h3>Que servi&ccedil;os est&atilde;o fora do ar?</h3>
<p>Fiz uma lista <a href='#servicos'>aqui</a>. Os sites comerciais n&atilde;o entram na lista.</p>
<h3>Pra onde v&atilde;o as doa&ccedil;&otilde;es e daonde v&ecirc;m?</h3>
<p><a href='#transparencia'>Aqui</a>.</p>
<h3>Tu quer que eu pague pra ti escrever c&oacute;digo e manter o servidor no ar?</h3>
<p>Negativo. Todo o trabalho aqui &eacute; volunt&aacute;rio e eu repudio a meritocracia. A porra do dinheiro &eacute; pro servi&ccedil;o de hospedagem. Se tu tiver um servidor com uplink de 100MB e que seja SEGURO e quiser doar pro movimento, me avisa.</p>
<h3>Porque dar dinheiro?</h3>
<p>Porque o servidor onde estes sites deveriam estar (<a href='https://gandi.net' target='_blank'>GANDI</a>) cobra pela hospedagem. Assim como todo e qualquer servidor. Quando o hi.ato.br estava hospeado em Porto Alegre - RS, eu gastava com energia el&eacute;trica e acesso &agrave; internet de alta velocidade.</p>
<h3>Porque investir tempo e dinheiro nisto ao inv&eacute;s do Facebook, Google, etc.?</h3>
<p>N&atilde;o precisa. Deixa a internet continuar sem ser livre. Ningu&eacute;m precisa de privacidade, liberdade de express&atilde;o. As pessoas s&oacute; precisam se alienar na internet. Volte para o <a href='https://www.facebook.com' target='_self'>mundo real</a>.</p>
<p>Os servi&ccedil;os ditos 'gratuitos' em verdade n&atilde;o s&atilde;o de gra&ccedil;a e ganham dinheiro para manter os custos dos servidores, que s&atilde;o alt&iacute;ssimos, atrav&eacute;s do conte&uacute;do fornecido pelos usu&aacute;rios. Isto &eacute; feito automaticamente e o teu trabalho volunt&aacute;rio como rato de laborat&oacute;rio &eacute; o que sustenta o custo deles, porque tem gente que paga pra manter o controle sobre os bilh&otilde;es de consumidores massificados.</p>
<p>Quando tu escolhe investir teu tempo e teus recursos em iniciativas livres e independentes, tu diminui a for&ccedil;a das ferramentas de domina&ccedil;&atilde;o em massa. Principalmente a for&ccedil;a que elas t&ecirc;m de te manter alienado com elas, mesmo com toda essa tua intelig&ecirc;ncia.</p>
<h3>Porque &eacute; que tu autoritariamente tirou tudo do ar? N&atilde;o &eacute; desrespeito com as pessoas isto?</h3>
<p>Eu n&atilde;o tirei tudo do ar, a r&aacute;dio balaio ainda ta tocando, escute uma m&uacute;sica "libert&aacute;ria, regional (brasileira e afins), livre, independente" como exemplo de que o servidor funciona, &eacute; &uacute;til e satisfaz todas premissas ut&oacute;picas, filos&oacute;ficas, ideol&oacute;gicas, etc.:</p>
<p>
	<audio controls='true' loop='true' preload='none'>
		<source type='audio/ogg' src='http://stream.hi.ato.br:8000/balaio.ogg.m3u'>
		<source type='audio/ogg' src='http://stream.hi.ato.br:8000/balaio.ogg'>
		Este navegador n&atilde;o funciona com audio em HTML5.
	</audio>
</p>
<p>Ou use o link: <a href='http://stream.hi.ato.br:8000/balaio.ogg.m3u' target='_blank'>R&aacute;dio Balaio</a> (funciona no <a href='https://www.mozilla.org/pt-BR/firefox/new/' target='_blank'>Firefox</a> e no <a href='https://www.google.com/chrome/' target='_blank'>Chrome</a>, pode ser utilizado tamb&eacute;m em players como o <a href='https://videolan.org' target='_blank'>VLC</a>.)</p>
<a href='#top'>In&iacute;cio</a>
<hr>
<a name='ajudar' />
<h2>Como ajudar?</h2>
<p>Quem tiver conhecimento t&eacute;cnico e quiser trabalhar VOLUNTARIAMENTE veja onde se encaixa nas "<a href='#trabalhar'>vagas</a>" abaixo.</p>
<p>Quem tiver dinheiro por favor fa&ccedil;a uma <a href='#doar'>doa&ccedil;&atilde;o</a>.</p>
<p>Quem n&atilde;o for dar nada, nem tempo nem dinheiro, mas ficou com pena, pode ajudar a disseminar e ajudar a mendigar <a href='#compartilhar'>compartilhando</a> esta p&aacute;gina por a&iacute;.</p>
<a href='#top'>In&iacute;cio</a>
<hr>
<a name='trabalhar' />
<h2>Trabalhar</h2>
<p>Quem quiser ajudar tem que estar ciente que isto aqui n&atilde;o paga pra trabalhar, n&atilde;o tem retorno financeiro nenhum, n&atilde;o tem reconhecimento nenhum porque n&atilde;o vai nome de ningu&eacute;m em p&aacute;gina de cr&eacute;ditos, somente o m&iacute;nimo necess&aacute;rio, n&atilde;o da pra fazer curr&iacute;culo, n&atilde;o da pra usar na escola, na academia, no trabalho, etc. Isto aqui &eacute; doa&ccedil;&atilde;o de verdade. Bastante trabalho, nenhum retorno financeiro e quanto menos reconhecimento, melhor.</p>
<p>Ah e tamb&eacute;m tudo o que se faz no Hacklab Independ&ecirc;ncia &eacute; dom&iacute;nio p&uacute;blico e software livre. Quem n&atilde;o concorda, n&atilde;o trabalhe, <a href='#doar'>colabore com dinheiro</a>.</p>
<p>Atualmente tem uma &uacute;nica pessoa fazendo a frente e outras cinco an&ocirc;nimas dando apoio. Ent&atilde;o tem vagas para:</p>
<div class='caixa'>
<h3>Marketeira(o) <span class='vermelho'>URGENTE</a></h3>
<p>Preciso de gente pra melhorar esta p&aacute;gina de mendigagem (aceito remover as refer&ecirc;ncias &agrave; mendigagem, por exemplo).</p>
<p>N&atilde;o &eacute; necess&aacute;rio saber escrever HTML, CSS e usar Git. Mas se souber, adianta o servi&ccedil;o.</p>
<p>Quem souber viralizar e ampliar a campanha e colaborar, estaria ajudando.</p>
<p>Isto &eacute; urgente porque o servidor n&atilde; vai durar nem at&eacute; o fim  de 2014 com o uso atual, e os outros sites comerciais que n&atilde;o est&atilde;o listados aqui tamb&eacute;m sair&atilde;o do ar.</p>
<p>N&atilde;o ganha nada pra fazer isto, mas pode trabalhar nos sites comerciais se quiser.</p>
</div>
<div class='caixa'>
<h3>Colaborador(a)</h3>
<p>(Pra quem tem tempo e/ou dedica&ccedil;&atilde;o e/ou quer ser agente ativa(o) no processo de busca pela independ&ecirc;ncia da internet)</p>
<p>Conhecimento necess&aacute;rio:</p>
<ul>
	<li>Vontade de aprender. Isto deve ser o suficiente para qualquer coisa.</li>
</ul>
<p>Conhecimento &uacute;til (n&iacute;vel de usu&aacute;rio e uso das ferramentas, nenhum conhecimento t&eacute;cnico necess&aacute;rio):</p>
<ul>
	<li>Diaspora*</li>
	<li>Friendica</li>
	<li>Red Matrix</li>
	<li>Elgg/Lorea</li>
	<li>Ikiwiki</li>
	<li>Mediawiki</li>
	<li>Trac</li>
	<li>Mumble</li>
	<li>Jabber/XMPP</li>
</ul>
<p>Conhecimento aceit&aacute;vel:</p>
<ul>
	<li>Markdown</li>
	<li>HTML</li>
	<li>CSS</li>
	<li>RSS</li>
	<li>eu j&aacute; falei Git?</li>
	<li>Wordpress</li>
	<li>Outras redes e ferramentas que ainda n&atilde;o tem por aqui (isto &eacute; o melhor&excl;)</li>
</ul>
</div>
<div class='caixa'>
<h3>Desenvolvedor(a)</h3>
<p>(Pra quem sabe programar, j&aacute; que eu n&atilde;o sei. Serve pra quem quer aprender tamb&eacute;m)</p>
<p>Conhecimento necess&aacute;rio:</p>
<ul>
	<li>Git. Pode ser Github.</li>
	<li>Vontade de aprender.</li>
</ul>
<p>Conhecimento desej&aacute;vel:</p>
<ul>
	<li>HTML5 e CCS</li>
	<li>Python, Web2Py, Flask, Quokka</li>
	<li>Ruby on Rails</li>
	<li>Perl</li>
	<li>Lua</li>
	<li>Mysql</li>
	<li>Postgresql</li>
	<li>MongoDB</li>
</ul>
<p>Conhecimento aceit&aacute;vel:</p>
<ul>
	<li>PHP</li>
	<li>Outros frameworks de Python e Rails n&atilde;o descritos acima</li>
	<li>Outros bancos de dados n&atilde;o descritos acima</li>
</ul>
<p>Conhecimento in&uacute;til:</p>
<ul>
	<li>Java</li>
</ul>
</div>
<div class='caixa'>
<h3>Administrador(a) de sistemas</h3>
<p>(Pra quem quer ser r00t que nem eu)</p>
<p>Conhecimento necess&aacute;rio:</p>
<ul>
	<li>ssh, scp, sftp e bash</li>
	<li>Debian (s&oacute; na linha de comando mesmo)</li>
</ul>
<p>Conhecimento desej&aacute;vel:</p>
<ul>
	<li>Apache</li>
	<li>Nginx</li>
	<li>Icecast, Ices</li>
	<li>Ruby on Rails, Redis</li>
	<li>Python, pip</li>
	<li>Perl, CPAN</li>
	<li>Git</li>
	<li>Mysql</li>
	<li>Postgresql</li>
	<li>MongoDB</li>
</ul>
<p>Conhecimento aceit&aacute;vel:</p>
<ul>
	<li>Administra&ccedil;&atilde;o de outros sistemas UNIX que n&atilde;o o Debian</li>
	<li>Administra&ccedil;&atilde;o de outras ferramentas e linguagens de programa&ccedil;&atilde;o web n&atilde;o listadas acima</li>
	<li>Administra&ccedil;&atilde;o de outros bancos de dados n&atilde;o descritos acima</li>
</ul>
</div>
<a href='#top'>In&iacute;cio</a>
<hr>
<a name='doar' />
<h2>Doar</h2>
<p>Para colaborar, doe com:</p>
<h3>Bitcoin</h3>
<p>Aguarde&excl;</p>
<h3>Moip</h3>
<p>Aguarde&excl;</p>
<h3>Paypal</h3>
<form action="https://www.paypal.com/cgi-bin/webscr" method="post" target="_top">
<input type="hidden" name="cmd" value="_s-xclick">
<input type="hidden" name="hosted_button_id" value="9CX7WS3HDGWHQ">
<input type="image" src="https://www.paypalobjects.com/pt_BR/i/btn/btn_donate_LG.gif" border="0" name="submit" alt="PayPal - A maneira fácil e segura de enviar pagamentos online!">
<img alt="" border="0" src="https://www.paypalobjects.com/pt_BR/i/scr/pixel.gif" width="1" height="1">
</form>
<h3>PagSeguro</h3>
<p>Aguarde&excl;</p>
<h3>Protoshares</h3>
<p>Aguarde&excl;</p>
<h3>Unlock</h3>
<p>Aguarde&excl;</p>
<p>Envie e-mail para hiatobr&#64;riseup.net informando sobre doa&ccedil;&otilde;es e declarando explicitamente se elas devem ser identificadas. Doa&ccedil;&otilde;es por padr&atilde;o s&atilde;o an&ocirc;nimas exceto nos casos onde podem ser rastreadas atrav&eacute;s de n&uacute;meros de transa&ccedil;&atilde;o. Neste caso, se alguma doa&ccedil;&atilde;o precisar ser totalmente an&ocirc;nima isto tamb&eacute;m deve ser explicitamente informado por e-mail.</p>
<p>Veja como s&atilde;o administradas estas doa&ccedil;&otilde;es na <a href='#transparencia'>presta&ccedil;&atilde;o de contas</a>.</p>
<a href='#top'>In&iacute;cio</a>
<hr>
<a name='compartilhar' />
<h2>Compartilhar</h2>
<p>Quem n&atilde;o tiver como doar pode ajudar a mendigar:</p>
<div class='caixa'>
<center>
<div class='indice'>
<ul>
<li>
<a href="http://sharetodiaspora.github.io/?title=Colabore%20com%20o%20Hacklab%20Independ%C3%AAncia&url=https://sos.hi.ato.br/" target="_blank"><img src="http://sharetodiaspora.github.io/favicon.png" style="border: 0px solid;" />&nbsp;Diaspora*</a>
</li>
<li>
<a href="//www.reddit.com/submit" onclick="window.location = '//www.reddit.com/submit?url=https://sos.hi.ato.br/'; return false"> <img src="//www.redditstatic.com/spreddit14.gif" alt="submit to reddit" border="0" /> </a>
</li>
<li>
<a href="https://twitter.com/share" class="twitter-share-button" data-url="https://sos.hi.ato.br/" data-text="Colabore com o Hacklab Independência" data-via="hiato_br" data-lang="pt" data-size="large" data-hashtags="Solidariedade" data-dnt="true">Tweetar</a>
<script>!function(d,s,id){var js,fjs=d.getElementsByTagName(s)[0],p=/^http:/.test(d.location)?'http':'https';if(!d.getElementById(id)){js=d.createElement(s);js.id=id;js.src=p+'://platform.twitter.com/widgets.js';fjs.parentNode.insertBefore(js,fjs);}}(document, 'script', 'twitter-wjs');</script>
</li>
<li>
<div class="fb-share-button" data-href="https://sos.hi.ato.br/" data-width="64" data-type="button_count"></div>
</li>
<li>
<script src="https://apis.google.com/js/platform.js" async defer></script>
<g:plus action="share" data-href="https://sos.hi.ato.br/"></g:plus>
</li>
</ul>
</div>
</center>
</div>
<a href='#top'>In&iacute;cio</a>
<hr>
<a name='transparencia' />
<h2>Presta&ccedil;&atilde;o de contas e transpar&ecirc;ncia</h2>
<p><a href='./saidas.html' target='_self'>P&aacute;gina de gastos</a></p>
<p><a href='./entradas.html' target='_self'>P&aacute;gina de doa&ccedil;&otilde;es</a></p>
<a href='#top'>In&iacute;cio</a>
<hr>
<a name='servicos' />
<h2>Serviços fora do ar:</h2>
<ul>
	<li>baixo.de (Semente <a href='https://lorea.org' target='_blank'>Lorea</a>, rede social federada)</li>
	<li>capoeira.li / midiacapoeira.in (M&iacute;dia Capoeira, plataforma para jornalismo independente em Web2Py)</li>
	<li>ira.li (Encurtador de links)</li>
	<li>mateau.la (Plataforma para tutoriais, guias e manuais)</li>
	<li>mentiro.so (Desconstru&ccedil;&atilde;o de mitos, mentiras e hoaxes)</li>
	<li>diaspora.hi.ato.br (<a href='https://joindiaspora.org' target='_blank'>Diaspora*</a>, rede social descentralizada)</li>
	<li>git.hi.ato.br (Reposit&oacute;rios git)</li>
	<li>gitweb.hi.ato.br (Servi&ccedil;o web para visualiza&ccedil;&atilde;o de reposit&oacute;rios em git.hi.ato.br)</li>
	<li>friendica.hi.ato.br (Uma Diaspora* melhorada)</li>
	<li>jabber.hi.ato.br (Servidor Jabber, mensagens instant&acirc;neas privativas e criptograf&aacute;veis)</li>
	<li>lorea.hi.ato.br (Semente <a href='https://lorea.org' target='_blank'>Lorea</a>, rede social federada)</li>
	<li>matrix.hi.ato.br (Red Matrix, um novo conceito em redes sociais descentralizadas)</li>
	<li>pad.hi.ato.br (Etherpad-lite, plataforma para produ&ccedil;&atilde;o colaborativa de documentos)</li>
	<li>palmar.es (Hacklab Palmares)</li>
	<li>politica.xyz (Projeto de transpar&ecirc;ncia e fiscaliza&ccedil;&atilde;o na pol&iacute;tica)</li>
	<li>projetos.hi.ato.br (Trac, sistema de gerenciamento de tempo e projetos)</li>
	<li>redes.xyz (Redescentraliza&ccedil;&atilde;o da internet)</li>
	<li>stream.hi.ato.br (Icecast2 e Ices2, plataforma de streaming de &aacute;udio e v&iacute;deo em vorbis/theora, r&aacute;dios e canais de tv web)</li>
	<li>tracker.hi.ato.br (Tracker para a rede de torrents)</li>
	<li>util.hi.ato.br (Utilidade p&uacute;blica e outros c&oacute;digos livres)</li>
	<li>voz.hi.ato.br (Servidor Mur Mur - Mumble)</li>
	<li>wiki.hi.ato.br (Ikiwiki, plataforma wiki colaborativa e an&ocirc;nima)</li>
	<li>www.hi.ato.br (Hacklab Independ&ecirc;ncia)</li>
	<li>ninguem.tem.blog.br (Hospedagem de blogs com diversas plataformas)</li>
</ul>
<p>O c&oacute;digo fonte de todos servi&ccedil;os est&atilde;o (ou poderiam estar) dispon&iacute;veis em <a href='https://github.com/hiatobr' target='_blank'>https://github.com/hiatobr</a></p>
<a href='#top'>In&iacute;cio</a>
<hr>
<a name='codigo' />
<h2>C&oacute;digo fonte</h2>
<p>O c&oacute;digo html e css desta p&aacute;gina &eacute; software livre e dom&iacute;nio p&uacute;blico assim como tudo no projeto Hacklab Independ&ecirc;ncia (e &eacute; por isto que eu estou sem dinheiro), e est&aacute; hospedado em: <a href='https://github.com/hiatobr/sos.hi.ato.br' target='_blank'>https://github.com/hiatobr/sos.hi.ato.br</a></p>
<a href='#top'>In&iacute;cio</a>
<hr>
<center><p><img src='./kopimi.png' />&nbsp;&nbsp;&nbsp;<img src='./anarchism.png' />&nbsp;&nbsp;&nbsp;<img src='./piratbyran.png' />&nbsp;&nbsp;&nbsp;<img src='./metarec.png' /></p></center>
</div>
</body>
</html>

